# ============================================
# БЛОК ПОДКЛЮЧЕНИЯ БИБЛИОТЕК
# ============================================
from flask import Flask, render_template

# ============================================
# БЛОК СОЗДАНИЯ ПРИЛОЖЕНИЯ FLASK
# ============================================
app = Flask(__name__)  # Инициализация Flask-приложения

# ============================================
# БЛОК ОПРЕДЕЛЕНИЯ МАРШРУТОВ (ROUTING)
# ============================================
@app.route('/')  # Декоратор, связывающий URL с функцией
def hello_world():
    # ВОЗВРАТ HTML-ШАБЛОНА
    return render_template("index.html")  # Рендер и отправка клиенту

# ============================================
# БЛОК ЗАПУСКА СЕРВЕРА
# ============================================
app.run("0.0.0.0")  # Запуск на всех доступных сетевых интерфейсах
